Revit 2026 API

# BoundaryValidation Methods

---

The BoundaryValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidBoundaryOnSketchPlane |  |
|  | IsValidBoundaryOnView |  |
|  | IsValidHorizontalBoundary |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BoundaryValidation Class

Autodesk.Revit.DB Namespace